html/meeting-notes/2012-11-06.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-11-06</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-14 17:49:52 EST"/>
<meta name="author" content="Rafe Kettler"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Meeting Notes 2012-11-06</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Andrew's Introduction to Elisp &ndash; https://gist.github.com/4028417 </a></li>
<li><a href="#sec-2">The notetaker must leave due to an interview. </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Andrew's Introduction to Elisp &ndash; <a href="https://gist.github.com/4028417">https://gist.github.com/4028417</a> </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Andrew has put together a basic introduction to Emacs Lisp. The format is a "literate" elisp source file that you can edit and run interactively as you learn.
</li>
<li>
Zach: I write "elsip" a lot too.
</li>
<li>
Polish notation (one area where Lisp lacks polish)
<ul>
<li>
Mish: So there's no infix for anything.
</li>
<li>
Andrew: Right.
</li>
<li>
Mish: Great.
</li>
</ul>
</li>
<li>
Zach suggests that we try eldoc-mode (this is on by default in Prelude)
</li>
<li>
C-M-x evaluates an entire expression, no matter where you are in the expression (perhaps we should use this instead of C-x C-e in most cases)
</li>
<li>
The number of square brackets around the mode line indicates how many debugger frames you are currently in&hellip;
<ul>
<li>
Andrew: @#$!
</li>
<li>
c exits the current frame, q exits the debugger altogether
</li>
</ul>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">The notetaker must leave due to an interview. </h2>
<div class="outline-text-2" id="text-2">

</div>
</div>
<div id="postamble">
<p class="author"> Author: Rafe Kettler
</p>
<p class="date"> Date: 2012-11-14 17:49:52 EST</p>
<p class="creator">HTML generated by org-mode 7.3 in emacs 24</p>
</div>
</div>
</body>
</html>
